; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image3 - mode
	infrared0 - mode
	spectrograph2 - mode
	image1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	GroundStation3 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 130)
	(= (data Planet4 image3) 36)
	(= (data Planet5 image3) 230)
	(= (data Planet6 image3) 71)
	(= (data Star7 image3) 107)
	(= (data Phenomenon8 image3) 200)
	(= (data Star9 image3) 140)
	(= (data Planet10 image3) 197)
	(= (data Star11 image3) 284)
	(= (data Planet4 infrared0) 275)
	(= (data Planet5 infrared0) 93)
	(= (data Planet6 infrared0) 286)
	(= (data Star7 infrared0) 41)
	(= (data Phenomenon8 infrared0) 172)
	(= (data Star9 infrared0) 234)
	(= (data Planet10 infrared0) 264)
	(= (data Star11 infrared0) 255)
	(= (data Planet4 spectrograph2) 76)
	(= (data Planet5 spectrograph2) 233)
	(= (data Planet6 spectrograph2) 36)
	(= (data Star7 spectrograph2) 155)
	(= (data Phenomenon8 spectrograph2) 73)
	(= (data Star9 spectrograph2) 260)
	(= (data Planet10 spectrograph2) 29)
	(= (data Star11 spectrograph2) 46)
	(= (data Planet4 image1) 290)
	(= (data Planet5 image1) 277)
	(= (data Planet6 image1) 300)
	(= (data Star7 image1) 187)
	(= (data Phenomenon8 image1) 178)
	(= (data Star9 image1) 237)
	(= (data Planet10 image1) 212)
	(= (data Star11 image1) 254)
	(= (slew_time GroundStation1 Star0) 38.64)
	(= (slew_time Star0 GroundStation1) 38.64)
	(= (slew_time Star2 Star0) 27.67)
	(= (slew_time Star0 Star2) 27.67)
	(= (slew_time Star2 GroundStation1) 40.04)
	(= (slew_time GroundStation1 Star2) 40.04)
	(= (slew_time GroundStation3 Star0) 2.898)
	(= (slew_time Star0 GroundStation3) 2.898)
	(= (slew_time GroundStation3 GroundStation1) 67.9)
	(= (slew_time GroundStation1 GroundStation3) 67.9)
	(= (slew_time GroundStation3 Star2) 1.37)
	(= (slew_time Star2 GroundStation3) 1.37)
	(= (slew_time Planet4 Star0) 76.29)
	(= (slew_time Star0 Planet4) 76.29)
	(= (slew_time Planet4 GroundStation1) 6.426)
	(= (slew_time GroundStation1 Planet4) 6.426)
	(= (slew_time Planet4 Star2) 1.861)
	(= (slew_time Star2 Planet4) 1.861)
	(= (slew_time Planet4 GroundStation3) 9.967)
	(= (slew_time GroundStation3 Planet4) 9.967)
	(= (slew_time Planet5 Star0) 67.31)
	(= (slew_time Star0 Planet5) 67.31)
	(= (slew_time Planet5 GroundStation1) 46.64)
	(= (slew_time GroundStation1 Planet5) 46.64)
	(= (slew_time Planet5 Star2) 56.5)
	(= (slew_time Star2 Planet5) 56.5)
	(= (slew_time Planet5 GroundStation3) 5.114)
	(= (slew_time GroundStation3 Planet5) 5.114)
	(= (slew_time Planet5 Planet4) 9.498)
	(= (slew_time Planet4 Planet5) 9.498)
	(= (slew_time Planet6 Star0) 9.124)
	(= (slew_time Star0 Planet6) 9.124)
	(= (slew_time Planet6 GroundStation1) 14.96)
	(= (slew_time GroundStation1 Planet6) 14.96)
	(= (slew_time Planet6 Star2) 86.33)
	(= (slew_time Star2 Planet6) 86.33)
	(= (slew_time Planet6 GroundStation3) 49.99)
	(= (slew_time GroundStation3 Planet6) 49.99)
	(= (slew_time Planet6 Planet4) 27.8)
	(= (slew_time Planet4 Planet6) 27.8)
	(= (slew_time Planet6 Planet5) 2.182)
	(= (slew_time Planet5 Planet6) 2.182)
	(= (slew_time Star7 Star0) 37.27)
	(= (slew_time Star0 Star7) 37.27)
	(= (slew_time Star7 GroundStation1) 40.07)
	(= (slew_time GroundStation1 Star7) 40.07)
	(= (slew_time Star7 Star2) 39.44)
	(= (slew_time Star2 Star7) 39.44)
	(= (slew_time Star7 GroundStation3) 30.1)
	(= (slew_time GroundStation3 Star7) 30.1)
	(= (slew_time Star7 Planet4) 6.938)
	(= (slew_time Planet4 Star7) 6.938)
	(= (slew_time Star7 Planet5) 68.43)
	(= (slew_time Planet5 Star7) 68.43)
	(= (slew_time Star7 Planet6) 34.35)
	(= (slew_time Planet6 Star7) 34.35)
	(= (slew_time Phenomenon8 Star0) 51.55)
	(= (slew_time Star0 Phenomenon8) 51.55)
	(= (slew_time Phenomenon8 GroundStation1) 11.41)
	(= (slew_time GroundStation1 Phenomenon8) 11.41)
	(= (slew_time Phenomenon8 Star2) 66.77)
	(= (slew_time Star2 Phenomenon8) 66.77)
	(= (slew_time Phenomenon8 GroundStation3) 71.08)
	(= (slew_time GroundStation3 Phenomenon8) 71.08)
	(= (slew_time Phenomenon8 Planet4) 84.17)
	(= (slew_time Planet4 Phenomenon8) 84.17)
	(= (slew_time Phenomenon8 Planet5) 19.71)
	(= (slew_time Planet5 Phenomenon8) 19.71)
	(= (slew_time Phenomenon8 Planet6) 60.84)
	(= (slew_time Planet6 Phenomenon8) 60.84)
	(= (slew_time Phenomenon8 Star7) 2.653)
	(= (slew_time Star7 Phenomenon8) 2.653)
	(= (slew_time Star9 Star0) 44.41)
	(= (slew_time Star0 Star9) 44.41)
	(= (slew_time Star9 GroundStation1) 9.557)
	(= (slew_time GroundStation1 Star9) 9.557)
	(= (slew_time Star9 Star2) 50.94)
	(= (slew_time Star2 Star9) 50.94)
	(= (slew_time Star9 GroundStation3) 60.85)
	(= (slew_time GroundStation3 Star9) 60.85)
	(= (slew_time Star9 Planet4) 42.15)
	(= (slew_time Planet4 Star9) 42.15)
	(= (slew_time Star9 Planet5) 14.45)
	(= (slew_time Planet5 Star9) 14.45)
	(= (slew_time Star9 Planet6) 33.26)
	(= (slew_time Planet6 Star9) 33.26)
	(= (slew_time Star9 Star7) 12.8)
	(= (slew_time Star7 Star9) 12.8)
	(= (slew_time Star9 Phenomenon8) 9.549)
	(= (slew_time Phenomenon8 Star9) 9.549)
	(= (slew_time Planet10 Star0) 3.453)
	(= (slew_time Star0 Planet10) 3.453)
	(= (slew_time Planet10 GroundStation1) 65.67)
	(= (slew_time GroundStation1 Planet10) 65.67)
	(= (slew_time Planet10 Star2) 42.89)
	(= (slew_time Star2 Planet10) 42.89)
	(= (slew_time Planet10 GroundStation3) 1.518)
	(= (slew_time GroundStation3 Planet10) 1.518)
	(= (slew_time Planet10 Planet4) 2.942)
	(= (slew_time Planet4 Planet10) 2.942)
	(= (slew_time Planet10 Planet5) 54.07)
	(= (slew_time Planet5 Planet10) 54.07)
	(= (slew_time Planet10 Planet6) 45.05)
	(= (slew_time Planet6 Planet10) 45.05)
	(= (slew_time Planet10 Star7) 7.344)
	(= (slew_time Star7 Planet10) 7.344)
	(= (slew_time Planet10 Phenomenon8) 3.004)
	(= (slew_time Phenomenon8 Planet10) 3.004)
	(= (slew_time Planet10 Star9) 2.864)
	(= (slew_time Star9 Planet10) 2.864)
	(= (slew_time Star11 Star0) 46.58)
	(= (slew_time Star0 Star11) 46.58)
	(= (slew_time Star11 GroundStation1) 84.5)
	(= (slew_time GroundStation1 Star11) 84.5)
	(= (slew_time Star11 Star2) 21.95)
	(= (slew_time Star2 Star11) 21.95)
	(= (slew_time Star11 GroundStation3) 17.99)
	(= (slew_time GroundStation3 Star11) 17.99)
	(= (slew_time Star11 Planet4) 39.76)
	(= (slew_time Planet4 Star11) 39.76)
	(= (slew_time Star11 Planet5) 73.39)
	(= (slew_time Planet5 Star11) 73.39)
	(= (slew_time Star11 Planet6) 28.03)
	(= (slew_time Planet6 Star11) 28.03)
	(= (slew_time Star11 Star7) 94.72)
	(= (slew_time Star7 Star11) 94.72)
	(= (slew_time Star11 Phenomenon8) 7.398)
	(= (slew_time Phenomenon8 Star11) 7.398)
	(= (slew_time Star11 Star9) 67.41)
	(= (slew_time Star9 Star11) 67.41)
	(= (slew_time Star11 Planet10) 57.33)
	(= (slew_time Planet10 Star11) 57.33)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Star7 spectrograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 130 to 115.55, (fuel-used) from 0 to 14.45
   goals met: 0 of 3
2. (turn_to satellite0 groundstation3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 115.55 to 110.436, (fuel-used) from 14.45 to 19.564
   goals met: 0 of 3
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
4. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 110.436 to 108.918, (fuel-used) from 19.564 to 21.082
   goals met: 0 of 3
5. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 108.918 to 107.4, (fuel-used) from 21.082 to 22.6
   goals met: 0 of 3
6. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 107.4 to 105.882, (fuel-used) from 22.6 to 24.118
   goals met: 0 of 3
7. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 105.882 to 104.364, (fuel-used) from 24.118 to 25.636
   goals met: 0 of 3
8. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 104.364 to 102.846, (fuel-used) from 25.636 to 27.154
   goals met: 0 of 3
9. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 102.846 to 101.328, (fuel-used) from 27.154 to 28.672
   goals met: 0 of 3
10. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 101.328 to 99.81, (fuel-used) from 28.672 to 30.19
   goals met: 0 of 3
11. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 99.81 to 98.292, (fuel-used) from 30.19 to 31.708
   goals met: 0 of 3
12. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 98.292 to 96.774, (fuel-used) from 31.708 to 33.226
   goals met: 0 of 3
13. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 96.774 to 95.256, (fuel-used) from 33.226 to 34.744
   goals met: 0 of 3
14. (turn_to satellite0 star7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 95.256 to 65.156, (fuel-used) from 34.744 to 64.844
   goals met: 0 of 3
15. (turn_to satellite0 star2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 65.156 to 25.716, (fuel-used) from 64.844 to 104.284
   goals met: 0 of 3
16. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 3
17. (turn_to satellite0 groundstation3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 25.716 to 24.346, (fuel-used) from 104.284 to 105.654
   goals met: 0 of 3
18. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 24.346 to 22.828, (fuel-used) from 105.654 to 107.172
   goals met: 0 of 3
19. (turn_to satellite0 star7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 22.828 to 15.484, (fuel-used) from 107.172 to 114.516
   goals met: 0 of 3
20. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   changed: (data_capacity satellite0) from 1000 to 845, (data-stored) from 0 to 155
   goals met: 1 of 3
21. (turn_to satellite0 phenomenon8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 15.484 to 12.831, (fuel-used) from 114.516 to 117.169
   goals met: 1 of 3
22. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 12.831 to 9.827, (fuel-used) from 117.169 to 120.173
   goals met: 1 of 3
23. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   changed: (fuel satellite0) from 9.827 to 8.309, (fuel-used) from 120.173 to 121.691
   goals met: 1 of 3
24. (turn_to satellite0 planet5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 8.309 to 3.195, (fuel-used) from 121.691 to 126.805
   goals met: 1 of 3
25. (take_image satellite0 planet5 instrument0 spectrograph2)
   added: (have_image planet5 spectrograph2)
   changed: (data_capacity satellite0) from 845 to 612, (data-stored) from 155 to 388
   goals met: 2 of 3
26. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 3.195 to 1.013, (fuel-used) from 126.805 to 128.987
   goals met: 2 of 3
27. (take_image satellite0 planet6 instrument0 spectrograph2)
   added: (have_image planet6 spectrograph2)
   changed: (data_capacity satellite0) from 612 to 576, (data-stored) from 388 to 424
   goals met: 3 of 3
